stubs/__files/partner/psl/read_equipment_49_661_2000_76H1.xml

<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<SOAP:Envelope xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/'>
    <SOAP:Header/>
    <SOAP:Body>
        <ns1:MT_EQDATA_RESPV2 xmlns:ns1='http://telekom.de/xi/NGERP_EXTD_PSL_INT/global/WMS/Equipment/Read/V2'>
            <eiMessageContext>
                <target xmlns='http://messaging.ei.tmobile.net/datatypes'>SI_ReadEquipmentResponseV2In_DigiOSS</target>
                <requestId xmlns='http://messaging.ei.tmobile.net/datatypes'>
                    urn:uuid:2df6d642-0661-41ec-aca1-a3e5b91cb9fb
                </requestId>
                <timeLeft xmlns='http://messaging.ei.tmobile.net/datatypes'>172800000</timeLeft>
                <priority xmlns='http://messaging.ei.tmobile.net/datatypes'>4</priority>
                <sender xmlns='http://messaging.ei.tmobile.net/datatypes'>sndr:tmo.erp.sap.architecture.SAP:PI</sender>
                <correlationId xmlns='http://messaging.ei.tmobile.net/datatypes'>d8c3bd56-c34e-45a6-ad54-7a51f81ce63d
                </correlationId>
            </eiMessageContext>
            <data>
                <MT_EQDATA_RESPV2>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>204012171</HEQUI>
                        <HEQNR>0056</HEQNR>
                        <ASB>4</ASB>
                        <TPLNR>000661-002000-001-001-002-005</TPLNR>
                        <EQART>G</EQART>
                        <ANZ_EBENEN>1</ANZ_EBENEN>
                        <EQUNR>6610494020</EQUNR>
                        <SERGE>MA58006610494020</SERGE>
                        <SUBMT>40916237</SUBMT>
                        <ADR_ID>19360263</ADR_ID>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0001</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494021</EQUNR>
                        <SERGE>H902FL6610494021</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0002</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494022</EQUNR>
                        <SERGE>H902FL6610494022</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0003</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494023</EQUNR>
                        <SERGE>H902FL6610494023</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0004</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494024</EQUNR>
                        <SERGE>H902FL6610494024</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0005</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494025</EQUNR>
                        <SERGE>H902FL6610494025</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0006</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494026</EQUNR>
                        <SERGE>H902FL6610494026</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0007</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494027</EQUNR>
                        <SERGE>H902FL6610494027</SERGE>
                        <SUBMT>40916243</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0008</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494028</EQUNR>
                        <SERGE>H902MP6610494028</SERGE>
                        <SUBMT>40916239</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/661/2000/76H1</ENDSZ>
                        <HEQUI>6610494020</HEQUI>
                        <HEQNR>0010</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>6610494029</EQUNR>
                        <SERGE>H902PI6610494029</SERGE>
                        <SUBMT>40916246</SUBMT>
                    </EQUI>
                    <KOPF>
                        <PARTNER>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/PARTNER/text()'}}</PARTNER>
                        <ANFO_KEN>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/ANFO_KEN/text()'}}</ANFO_KEN>
                    </KOPF>
                    <STATUS>
                        <LOG_NO>0000000000</LOG_NO>
                        <NUMBER>000</NUMBER>
                        <SYSTEM>Linux</SYSTEM>
                        <LOG_NO>string</LOG_NO>
                        <ID>ZDIB</ID>
                        <MESSAGE>Die Anforderung wurde ausgeführt.</MESSAGE>
                        <TYPE>S</TYPE>
                    </STATUS>
                </MT_EQDATA_RESPV2>
            </data>
        </ns1:MT_EQDATA_RESPV2>
    </SOAP:Body>
</SOAP:Envelope>